Configuration of Router   R1: 
 
hostname R1 
interface gi0/1
no shutdown 
 ip address 10.1.1.10 255.255.255.0 
 
interface loop0   
ip address 1.1.1.1 255.255.255.0 
 
ip route 0.0.0.0 0.0.0.0 10.1.1.1 
 
line vty 0 4   
password cisco   
transport input all    
login   
enable secret cisco
!
  
hostname R2 
interface gi0/1
no shutdown 
 ip address 20.1.1.10 255.255.255.0 
 
interface loop0   
ip address 2.2.2.2 255.255.255.0 
 
ip route 0.0.0.0 0.0.0.0 20.1.1.1 
 
line vty 0 4   
password cisco   
transport input all    
login   
enable secret cisco
!

Configuration of Firewall 
 
ASAv1: 
 
hostname ASAv1 
 
interface g0/0   
no shutdown   
nameif outside   
ip address 20.1.1.1 255.255.255.0 
 
interface g 0/1   
no shutdown   
nameif inside   
ip address 10.1.1.1 255.255.255.0 
 
route outside 0.0.0.0 0.0.0.0 20.1.1.10 
route inside 1.1.1.0 255.255.255.0 10.1.1.10 
!
Verifications: 
 
R1#ping 10.1.1.1 
 
Type escape sequence to abort. Sending 5, 100-byte ICMP Echos to 10.1.1.1, timeout is 2 seconds: !!!!! Success rate is 100 percent (5/5), round-trip min/avg/max = 24/39/64 ms 
 
R2#ping 20.1.1.1 
 
Type escape sequence to abort. Sending 5, 100-byte ICMP Echos to 20.1.1.1, timeout is 2 seconds: !!!!! Success rate is 100 percent (5/5), round-trip min/avg/max = 24/51/72 ms 
 
 
ASAv1# show arp         
outside 20.1.1.10 c202.5608.0000 34         
inside 10.1.1.10 c201.5757.0000 187 
 
 
R1#telnet 20.1.1.10  
Trying 20.1.1.10 ... Open User Access Verification Password:  R2> 
 
 
ASAv1# show conn  
1 in use, 1 most used TCP outside  20.1.1.10:23 inside  10.1.1.10:15427, idle 0:00:52, bytes 102, flags UIO  
 
 
R1#telnet 2.2.2.2 
Trying 2.2.2.2 ... Open User Access Verification Password:  R2> 
 
ASAv1# show conn 
1 in use, 1 most used TCP outside 2.2.2.2:23 inside  10.1.1.10:55738, idle 0:00:03, bytes 106, flags UIO 
 
 
R1#telnet 2.2.2.2 /source-interface loopback 0 
Trying 2.2.2.2 ... Open User Access Verification Password:  
R2> 

ASAv1# show conn       1 in use, 1 most used TCP outside 2.2.2.2:23 inside  1.1.1.1:17916, idle 0:00:21, bytes 102, flags UIO  

 
 
R1#ping 2.2.2.2 
 
Type escape sequence to abort. Sending 5, 100-byte ICMP Echos to 2.2.2.2, timeout is 2 seconds: ..... Success rate is 0 percent (0/5) 
 
R1#ping 20.1.1.10 
 
Type escape sequence to abort. Sending 5, 100-byte ICMP Echos to 20.1.1.10, timeout is 2 seconds: ..... Success rate is 0 percent (0/5) 
 
 
R2#ping 1.1.1.1 
 
Type escape sequence to abort. Sending 5, 100-byte ICMP Echos to 1.1.1.1, timeout is 2 seconds: ..... Success rate is 0 percent (0/5) 
 
 
R2#ping 10.1.1.10 
 
Type escape sequence to abort. Sending 5, 100-byte ICMP Echos to 10.1.1.10, timeout is 2 seconds: ..... Success rate is 0 percent (0/5) 
 
 
R2#telnet 1.1.1.1 
 
Trying 1.1.1.1 ...  % Connection timed out; remote host not responding 

R2#telnet 10.1.1.10 
Trying 10.1.1.10 ...  % Connection timed out; remote host not responding 


 
 