Configuration on Router 
 
R100: 
 
int gi0/1 
no sh 
ip address 10.1.1.10 255.255.255.0 
exit 
 !
ip route 0.0.0.0 0.0.0.0 10.1.1.1 
 !
int lo0 
ip address 2.2.2.2 255.255.255.0
description DB-Server 
!
 int lo1 
 ip address 12.12.12.12 255.255.255.0 
 description App-Server 
 !
int lo2 
ip address 122.122.122.122 255.255.255.0 
description Inside-PC 
 !
 Configuration on Router 
 
R200: 

int gi0/1 
no sh 
ip address 20.1.1.10 255.255.255.0 
exit 
 !
ip route 0.0.0.0 0.0.0.0 20.1.1.1 
 !
int lo0 
ip add ip address 8.8.8.8 255.255.255.0 
description google.com 
 !
int lo1 
ip address 4.4.4.4 255.255.255.0 
 !
int lo2            
ip address 45.45.45.45 255.255.255.0 
description Outside-PC1 
! 
int lo3 
ip address 55.55.55.55 255.255.255.0  
description Outside-PC2 
!
Configuration on Router 
 
R300: 
 
int gi0/1 
ip add ip address 30.1.1.10 255.255.255.0 
no sh 
! 
ip route 0.0.0.0 0.0.0.0 30.1.1.1 
 !
int lo0 
ip address 3.3.3.3 255.255.255.0 
description Web-Server1 
! 
int lo1 
ip address 13.13.13.13 255.255.255.0 
description Web-Server2               
int lo2                              
ip address 133.133.133.133 255.255.255.0 
description Web-Server3  
!
line vty 0 4 
password cisco
 login  
tranport input all  
!
Configuration Firewall 
 
ASA1 
interface GigabitEthernet0/1  
nameif inside  
security-level 100  
ip address 10.1.1.1 255.255.255.0 
!
interface GigabitEthernet0/0  
nameif outside  
security-level 0  
ip address 20.1.1.1 255.255.255.0 
!
interface GigabitEthernet0/2  
nameif dmz  
security-level 50  
ip address 30.1.1.1 255.255.255.0 
! 
 

 Task-1 Configure the Static Auto NAT on ASA1 for Web-Server1 
 
 Configure ASA so that when someone from the outside (network segment behind ASA’s OUTSIDE interface) tries to connect to IP address of 20.1.1.50 he/she will be pointed to WebServer1.  
 
Configuration on Firewall 
 
ASA1: object network Web-Server1  host 3.3.3.3 nat (dmz,outside) static 20.1.1.50 
 
access-list OUT-IN extended permit ip any host 3.3.3.3 access-group OUT-IN in interface outside 
 
route dmz 3.3.3.0 255.255.255.0 30.1.1.10  
 
 
R200#telnet 20.1.1.50 Trying 20.1.1.50 ... Open 
 
 ASA1# show nat 
 
Auto NAT Policies (Section 2) 1 (dmz) to (outside) source static Web-Server1 20.1.1.50     
 
ASA1# show conn  


Task-2 Configure the Static Auto PAT on ASA1 for Web-Server2 
 
 Configure ASA so that when someone from the outside (network segment behind ASA’s OUTSIDE interface) tries to connect to IP address of 20.1.1.51 using TELNET he/she will be pointed to Web-Server2.  
 
Configuration on Firewall 
 
ASA1: 
 
object network Web-Server2  host 13.13.13.13 nat (dmz,outside) static 20.1.1.51 service tcp 23 23 
 
access-list OUT-IN extended permit tcp any host 13.13.13.13 eq 23 route dmz 13.13.13.0 255.255.255.0 30.1.1.10  
 
 
 Verification 
R200#telnet 20.1.1.51 
Trying 20.1.1.51 ... Open 
 
User Access Verification Password:  R300>show user     Line       User       Host(s)              Idle       Location 
*  2 vty 0                idle                 00:00:00 20.1.1.10 
 
 
ASA1# show conn  
2 in use, 15 most used 
TCP outside  20.1.1.10:23554 dmz  13.13.13.13:23, idle 0:01:42, bytes 466, flags UIOB 

Task-3 Configure Static Manual NAT on ASA1 Between Web-Server3 and Inside-PC (Identity NAT) 
 
 Configure ASA so that when Inside-PC from the inside network tries to connect to Web-Server3, the Inside-PC ip should change to mapped interface, and Web-Server3 ip should remain same and intact.   The translation must be enforced only for traffic going between Inside-PC and Web-Server3 only.  
 
Configuration on Firewall 
ASA1: 
object network Web-Server3 host 133.133.133.133 object network Inside-PC  host 122.122.122.122 
 
nat (inside,dmz) source static Inside-PC interface destination static Web-Server3 WebServer3 
route dmz 3.3.3.0 255.255.255.0 30.1.1.10 1 route inside 12.12.12.0 255.255.255.0 10.1.1.10 1 route dmz 13.13.13.0 255.255.255.0 30.1.1.10 1 route inside 122.122.122.0 255.255.255.0 10.1.1.10 1 route dmz 133.133.133.0 255.255.255.0 30.1.1.10 1 
 
Verification: 
R100#telnet 133.133.133.133  
Trying 133.133.133.133 ... Open User Access Verification Password:  R300>show user     Line       User       Host(s)              Idle       Location    2 vty 0                idle                 00:06:59 150.1.7.20 *  3 vty 1                idle                 00:00:00 10.1.1.10 As we can see that the it is using the interface ip of R100 instead of 122.122.122.122. 
Verification: 
ASA1# show nat 
Manual NAT Policies (Section 1) 1 (inside) to (dmz) source static Inside-PC interface destination static Web-Server3 WebServer3     translate_hits = 0, untranslate_hits = 0 
 
Auto NAT Policies (Section 2) 1 (dmz) to (outside) source static Web-Server1 20.1.1.50      translate_hits = 0, untranslate_hits = 1 2 (dmz) to (outside) source static Web-Server2 20.1.1.51  service tcp telnet telnet      translate_hits = 0, untranslate_hits = 1 
 
ASA1# show nat Manual NAT Policies (Section 1) 1 (inside) to (dmz) source static Inside-PC interface destination static Web-Server3 WebServer3     translate_hits = 1, untranslate_hits = 1 
 
Auto NAT Policies (Section 2) 1 (dmz) to (outside) source static Web-Server1 20.1.1.50      translate_hits = 0, untranslate_hits = 0 2 (dmz) to (outside) source static Web-Server2 20.1.1.51  service tcp telnet telnet      translate_hits = 0, untranslate_hits = 0 
 
ASA1# show xlate  4 in use, 4 most used Flags: D - DNS, e - extended, I - identity, i - dynamic, r - portmap,        s - static, T - twice, N - net-to-net NAT from dmz:3.3.3.3 to outside:20.1.1.50     flags s idle 19:07:32 timeout 0:00:00 TCP PAT from dmz:13.13.13.13 23-23 to outside:20.1.1.51 23-23     flags sr idle 18:45:55 timeout 0:00:00 NAT from inside:122.122.122.122 to dmz:30.1.1.1     flags sT idle 0:01:41 timeout 0:00:00 NAT from dmz:133.133.133.133 to inside:133.133.133.133     flags sIT idle 0:01:41 timeout 0:00:00 
 
 
 
ASA1# show conn  2 in use, 15 most used 

 TCP dmz  133.133.133.133:23 inside  122.122.122.122:47106, idle 0:02:14, bytes 540, flags UIO 
 
 
R100#telnet 133.133.133.133 /source-interface lo2 Trying 133.133.133.133 ... Open User Access Verification Password:  R300> R300>show users      Line       User       Host(s)              Idle       Location *  2 vty 0                idle                 00:00:00 30.1.1.1 
 
 
 Task-4 Configure Static Manual NAT on ASA1 Between Outside-PC1  and Web-Server1 (Twice NAT) 
 
 Configure ASA so that when someone from the Outside-PC1 try to do telnet to DMZ WebServer1, the Outside-PC1 identity should change to 20.1.1.100 and the Web-Server1 identity should change to 30.1.1.100. (Twice NAT) 
 
 
Configuration on Firewall 
 
ASA1: 
 
object network Web-Server1  host 3.3.3.3 object network Outside-PC1  host 45.45.45.45 object network Mapped-Web-Server1  host 30.1.1.100 object network Mapped-Outside-PC1  host 20.1.1.100 
 
nat (dmz,outside) source static Web-Server1 Mapped-Web-Server1 destination static Mapped-Outside-PC1 Outside-PC1 
 
route outside 0.0.0.0 0.0.0.0 20.1.1.10 1 
 
access-list OUT-IN extended permit ip any host 3.3.3.3 access-group OUT-IN in interface outside 
 
 
Verification 
 
ASA1# show nat 1 (dmz) to (outside) source static Web-Server1 Mapped-Web-Server1  destination static Mapped-Outside-PC1 Outside-PC1     translate_hits = 1, untranslate_hits = 1 

 ASA1# show conn  2 in use, 15 most used TCP outside  20.1.1.100(45.45.45.45):30210 dmz  3.3.3.3:23, idle 0:02:14, bytes 484, flags UIOB 
 
ASA1# show xlate NAT from outside:45.45.45.45 to dmz:20.1.1.100     flags sT idle 0:02:35 timeout 0:00:00 
 
 
R200#telnet 30.1.1.100 /source-interface lo2 Trying 30.1.1.100 ... Open 
 
User Access Verification Password:  R300>show users      Line       User       Host(s)              Idle       Location *  2 vty 0                idle                 00:00:00 20.1.1.100 


